In [42]:
# Dependencies - Importing Pandas library and storing it as pd
import os
import pandas as pd
import json

In [43]:
# saving the path to the data file
data_read = os.path.join(".", "purchase_data.json")
data_read

'.\\purchase_data.json'

In [230]:
with open(data_read) as data_file:
    data = pd.read_json(data_file)
dataframe_df = pd.DataFrame(data)
dataframe_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59

In [178]:
# Creating a Pandas series from the series list given in the problem
data_series = pd.Series(["SN", "Age", "Gender", "Item_ID", "Item Name", "Price"])
data_series

0           SN
1          Age
2       Gender
3      Item_ID
4    Item Name
5        Price
dtype: object

In [179]:
# Player Count - Total number of players
player_count = len(dataframe_df.SN.value_counts())
print("Player Count is : " + str(player_count))

Player Count is : 573

In [180]:
# Purchasing Analysis (Total)
#* Number of Unique Items
#* Average Purchase Price
#* Total Number of Purchases
#* Total Revenue

number_unique_items = len(dataframe_df["Item ID"].unique())
number_unique_items

183

In [181]:
#Total Revenue
total_purchases = dataframe_df.Price.sum()
total_purchases

2286.33

In [182]:
#* Average Purchase Price
av_pur_price = total_purchases/len(dataframe_df)
av_pur_price

2.9311923076923074

In [183]:
#* Total Number of Purchases
total_no_purchases = len(dataframe_df)
total_no_purchases

780

In [184]:
# Purchasing Analysis (Total)
#* Number of Unique Items
#* Average Purchase Price
#* Total Number of Purchases
#* Total Revenue

pur_analysis_summary = pd.DataFrame({"Number of Unique Items":number_unique_items, "Average Purchase Price":av_pur_price,"Total Number of Purchases":total_no_purchases,"Total Revenue":total_purchases }, index = [0])
print("Purchase Analysis Summary")
pur_analysis_summary

Purchase Analysis Summary

,Average Purchase Price,Number of Unique Items,Total Number of Purchases,Total Revenue
0,2.931192,183,780,2286.33

In [194]:
### Gender Demographics

#* Percentage and Count of Male Players
#* Percentage and Count of Female Players
#* Percentage and Count of Other / Non-Disclosed

grouped_data_df = dataframe_df.groupby("Gender")
grouped_data_df

In [301]:
gender_data = grouped_data_df["Age"].count()

gender_data

Gender
Female                   136
Male                     633
Other / Non-Disclosed     11
Name: Age, dtype: int64

In [303]:
 average_price_gender= grouped_data_df.mean()
average_price_gender

                             Age     Item ID     Price
Gender
Female                 22.558824   88.110294  2.815515
Male                   22.685624   91.571880  2.950521
Other / Non-Disclosed  27.363636  114.636364  3.249091

In [319]:
percentage_male_players = ((gender_data_df.iloc[1,0])/gender_data.sum())*100
percentage_female_players = ((gender_data_df.iloc[0,0])/gender_data.sum())*100
percentage_other_players = (11/gender_data.sum())*100

lst = [percentage_male_players, percentage_female_players,percentage_other_players]

gender_demographics_summary = pd.DataFrame({"Count of Players:": gender_data,"Percentage of Players":lst})

gender_demographics_summary

                       Count of Players:  Percentage of Players
Gender
Female                               136              81.153846
Male                                 633              17.435897
Other / Non-Disclosed                 11               1.410256

In [201]:
total_purchase_price_gender= grouped_data_df.sum()
total_purchase_price_gender

                         Age  Item ID    Price
Gender
Female                  3068    11983   382.91
Male                   14360    57965  1867.68
Other / Non-Disclosed    301     1261    35.74

In [219]:
normalized_pur_price = total_purchase_price_gender.iloc[:,2]/gender_data.iloc[:,1]
normalized_pur_price

Gender
Female                   2.815515
Male                     2.950521
Other / Non-Disclosed    3.249091
dtype: float64

In [211]:
total_purchase_price_gender.iloc[1,2] =total_price

1867.6799999999985

In [247]:
grouped_data_df["Age"]
grouped_data_df.head()

,Age,Gender,Item ID,Item Name,Price,SN
0,38,Male,165,Bone Crushing Silver Skewer,3.37,Aelalis34
1,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,Eolo46
2,34,Male,174,Primitive Blade,2.46,Assastnya25
3,21,Male,92,Final Critic,1.36,Pheusrical25
4,23,Male,63,Stormfury Mace,1.27,Aela59
7,29,Female,169,"Interrogator, Blood Blade of the Queen",3.32,Iathenudil29
16,22,Female,123,Twilight's Carver,1.14,Sundista85
17,22,Female,59,"Lightning, Etcher of the King",1.65,Aenarap34
22,11,Female,11,Brimstone,2.52,Deural48
29,16,Female,45,Glinting Glass Edge,2.46,Phaedai25
177,34,Other / Non-Disclosed,155,War-Forged Gold Deflector,3.73,Assassa38
209,33,Other / Non-Disclosed,157,"Spada, Etcher of Hatred",2.21,Frichistasta59
244,21,Other / Non-Disclosed,183,Dragon's Greatsword,2.36,Tyaerith73
267,33,Other / Non-Disclosed,65,Conqueror Adamantite Mace,1.96,Frichistasta59
276,12,Other / Non-Disclosed,128,"Blazeguard, Reach of Eternity",4.00,Aillycal84

In [325]:
### Purchase Analysis (Gender)

#  * Purchase Count
#  * Average Purchase Price
#  * Total Purchase Value
#  * Normalized Totals

age_demo_df = dataframe_df.groupby(["Gender"])
player_demographics = dataframe_df.loc[:,["Age", "Price", "SN"]]

age_pur_count = age_demo_df["Price"].count()
age_pur_average = age_demo_df["Price"].mean()
age_total_pur_value = age_demo_df["Price"].sum()

normalized_total = age_total_pur_value/age_pur_count


age_summary_table = pd.DataFrame({"Purchase Count": age_pur_count, "Average Purchase Price":age_pur_average, "Total Purchase Value":age_total_pur_value, "Normalized Total": normalized_total})

age_summary_table.head()

,Average Purchase Price,Normalized Total,Purchase Count,Total Purchase Value
Gender,,,,
Female,2.815515,2.815515,136,382.91
Male,2.950521,2.950521,633,1867.68
Other / Non-Disclosed,3.249091,3.249091,11,35.74

In [365]:
### Age Demographics
#* The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
#  * Purchase Count
#  * Average Purchase Price
#  * Total Purchase Value
#  * Normalized Total

player_demographics = pd.DataFrame(dataframe_df.loc[:,["Age","Price","SN"]])

age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99]
age_labels = ['Less than 10', '10-14', '14-19','19-24', '25-29', '30-34', '35-39', '40 and above']

player_demographics["Age Group"] = pd.cut(player_demographics["Age"],bins=age_bins, labels = age_labels)

player_demographics_total = player_demographics["Age Group"].value_counts()

player_percentage_totals = player_demographics_total/age_pur_count

tot_pur_value =age_demo_df["Price"].sum()
normalized_total_age = tot_pur_value/player_demographics_total


player_demographics_summary = pd.DataFrame({"Player Total" : player_demographics_total,"Player percentage":player_percentage_totals,"Total Purchase Value":tot_pur_value, "Normalized Total": normalized_total_age})
player_demographics_summary

,Normalized Total,Player Total,Player percentage,Total Purchase Value
10-14,NaN,35.0,NaN,NaN
14-19,NaN,133.0,NaN,NaN
19-24,NaN,336.0,NaN,NaN
25-29,NaN,125.0,NaN,NaN
30-34,NaN,64.0,NaN,NaN
35-39,NaN,42.0,NaN,NaN
40 and above,NaN,17.0,NaN,NaN
Female,NaN,NaN,NaN,382.91
Less than 10,NaN,28.0,NaN,NaN
Male,NaN,NaN,NaN,1867.68
Other / Non-Disclosed,NaN,NaN,NaN,35.74

In [349]:
### Top Spenders

#* Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
#  * SN
#  * Purchase Count
#  * Average Purchase Price
#  * Total Purchase Value

top_spenders_df = dataframe_df.groupby("SN")

In [66]:
pur_count = top_spenders_df["SN"].count()
pur_count

SN
Adairialis76       1
Aduephos78         3
Aeduera68          3
Aela49             1
Aela59             1
Aelalis34          2
Aelin32            1
Aeliriam77         2
Aeliriarin93       1
Aeliru63           2
Aellyria80         1
Aellyrialis39      1
Aellysup38         1
Aelollo59          1
Aenarap34          1
Aenasu69           1
Aeral43            1
Aeral85            1
Aeral97            1
Aeri84             2
Aerillorin70       1
Aerithllora36      3
Aerithnucal56      2
Aerithnuphos61     1
Aerithriaphos45    1
Aesty51            1
Aesur96            1
Aethe80            1
Aethedru70         1
Aidain51           2
                  ..
Undjaskla97        1
Undjasksya56       1
Undotesta33        1
Wailin72           1
Whaestysu86        1
Yadacal26          1
Yadaisuir65        2
Yadanun74          3
Yalaeria91         1
Yaliru88           1
Yalo71             1
Yalostiphos68      1
Yaralnura48        2
Yararmol43         1
Yarirarn35         1
Yaristi64          1
Yarithllodeu72     1
Yarithphos28       1
Yarithsurgue62     2
Yarmol79           1
Yarolwen77         2
Yasriphos60        3
Yasrisu92          1
Yasur35            1
Yasur85            1
Yasurra52          1
Yathecal72         2
Yathecal82         1
Zhisrisu83         2
Zontibe81          1
Name: SN, Length: 573, dtype: int64

In [350]:
av_pur_price = top_spenders_df["Price"].sum()/pur_count
av_pur_price.head()

SN
Adairialis76    2.460000
Aduephos78      2.233333
Aeduera68       1.933333
Aela49          2.460000
Aela59          1.270000
dtype: float64

In [118]:
#  * Total Purchase Value
total_purchase_value = top_spenders_df["Price"].sum()
total_purchase_value_df = pd.DataFrame(total_purchase_value)
total_purchase_value_df = total_purchase_value_df.sort_values("Price", ascending = False)
total_purchase_value_df.reset_index()
total_purchases = []
total_purchase_value_df[0:5]

             Price
SN
Undirrala66  17.06
Saedue76     13.56
Mindimnya67  12.74
Haellysu29   12.73
Eoda93       11.58

In [126]:
top_spenders_summary_table= pd.DataFrame({"Average Purchase Price": av_pur_price,"Purchase Count": pur_count, "Total_Purchases":list(total_purchase_value_df["Price"])})
top_spenders_summary_table.head()

              Average Purchase Price  Purchase Count  Total_Purchases
SN
Adairialis76                2.460000               1            17.06
Aduephos78                  2.233333               3            13.56
Aeduera68                   1.933333               3            12.74
Aela49                      2.460000               1            12.73
Aela59                      1.270000               1            11.58

In [124]:
list(total_purchase_value_df["Price"][0:5])

[17.06, 13.56, 12.739999999999998, 12.73, 11.58]

In [574]:
### Most Popular Items

#* Identify the 5 most popular items by purchase count, then list (in a table):
# * Item ID
#  * Item Name
#* Purchase count
# * Item Price
#  * Total Purchase Value
most_pop_df = dataframe_df.groupby("Item ID")
total_purchase_value = most_pop_df["Price"].sum()
total_purchase_value_df = pd.DataFrame(total_purchase_value)
total_purchase_value_df = total_purchase_value_df.sort_values("Price", ascending = False)
total_purchase_value_df.reset_index()
total_purchase_value_df[0:5]
pur_count = most_pop_df["Item ID"].count()

total_purchase_value_df.head()

         Price
Item ID
34       37.26
115      29.75
32       29.70
103      29.22
107      28.88

In [573]:
#* Identify the 5 most profitable items by total purchase value, then list (in a table):
#  * Item ID
#  * Item Name
#  * Purchase Count
#  * Item Price
#  * Total Purchase Value